{
  "subtree": [
    {
      "speaker": "Statue",
      "line": "Halt. Who goes there?"
    },
    {
      "speaker": "Oracle",
      "line": "I hail from the Tower of Oracles. Are you the keeper of this fiery door?"
    },
    {
      "speaker": "Statue",
      "line": "Yes, walker. Only I can grant passage. What brings you into this corner of Mirari's abyss?"
    },
    {
      "speaker": "Oracle",
      "line": "It is my charge to protect the life of our King."
    },
    {
      "speaker": "Oracle",
      "line": "Thus, have I travelled through dream upon dream seeking answers."
    },
    {
      "speaker": "Oracle",
      "line": "A trusted source has informed me that a key to the consipiracy on his life lies behind that door, this solemn corner of Mirari's mind."
    },
    {
      "speaker": "Guardian",
      "line": "Well, I shall not grant passage to you."
    },
    {
      "speaker": "Oracle",
      "line": "And why not?"
    },
    {
      "speaker": "Guardian",
      "line": "You are not worthy..."
    },
    {
      "speaker": "Guardian",
      "line": "There is nothing for you here.",
      "choices": [
        [
          {
            "speaker": "Oracle",
            "line": "I see. How long have you guarded this door, creature?"
          },
          {
            "speaker": "Guardian",
            "line": "The rage of this door has held fast for eight summers in the making."
          },
          {
            "speaker": "Oracle",
            "line": "All of eight summers?"
          },
          {
            "speaker": "Guardian",
            "line": "The grievances perpetrated by the King are immense and hard to bear. Mirari's grief is boundless."
          },
          {
            "speaker": "Oracle",
            "line": "But why must you guard this place? Surely grief is better shared than harbored deep within."
          },
          {
            "speaker": "Guardian",
            "line": "Grief is part of the problem. Another part is Strakos. Prove to me that you know of the problem.",
            "end": true
          }
        ],
        [
          {
            "speaker": "Oracle",
            "line": "For there is grief in my heart as well. "
          },
          {
            "speaker": "Guardian",
            "line": "What anger do you hold?"
          },
          {
            "speaker": "Oracle",
            "line": "An anger burning bright. I have wondered through these dreams endlessly it would seem."
          },
          {
            "speaker": "Oracle",
            "line": "An anger burning bright. I have wondered through these dreams endlessly it would seem."
          },
          {
            "speaker": "Oracle",
            "line": "And yet I do not feel much closer to finding the truth."
          },
          {
            "speaker": "Oracle",
            "line": "Your master likely holds ill will for my homeland. I cannot help but anger."
          },
          {
            "speaker": "Guardian",
            "line": "I know what your heart feels. If you wish to bear the heart of fire. I must challenge you to strike me down. I cannot dispel the curse until you do.",
            "end": true
          }
        ],
        [
          {
            "speaker": "Oracle",
            "line": "I need to pass through and you will not stand in my way."
          },
          {
            "speaker": "Guardian",
            "line": "And how do you suppose to do so?"
          },
          {
            "speaker": "Oracle",
            "line": "By striking you down where you stand?"
          },
          {
            "speaker": "Guardian",
            "line": "I am rage. I am Mirari's spirit of vengeance. Do you think that I could buckle so easily?"
          },
          {
            "speaker": "Guardian",
            "line": "No, but I hold dominion over you with my staff."
          },
          {
            "speaker": "Guardian",
            "line": "You dare?"
          },
          {
            "speaker": "Guardian",
            "line": "You must attack me!",
            "end": true
          }
        ]
      ]
    }
  ]
}
